wyniki_zwykle/fio_results_btrfs_nvme/block_size_32768_compression_none/lab-sec-13/fio_archive_test_output.txt
archive_test: (g=0): rw=write, bs=(R) 64.0KiB-128KiB, (W) 64.0KiB-128KiB, (T) 64.0KiB-128KiB, ioengine=libaio, iodepth=128
...
fio-3.36
Starting 2 processes
archive_test: Laying out IO file (1 file / 10240MiB)
archive_test: Laying out IO file (1 file / 10240MiB)

archive_test: (groupid=0, jobs=2): err= 0: pid=91835: Sat May  3 09:03:29 2025
  write: IOPS=4136, BW=336MiB/s (352MB/s)(20.0GiB/60922msec); 0 zone resets
    slat (usec): min=12, max=37195, avg=124.88, stdev=354.73
    clat (msec): min=2, max=474, avg=61.46, stdev=39.36
     lat (msec): min=2, max=474, avg=61.58, stdev=39.35
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   17], 10.00th=[   22], 20.00th=[   30],
     | 30.00th=[   39], 40.00th=[   47], 50.00th=[   55], 60.00th=[   64],
     | 70.00th=[   73], 80.00th=[   85], 90.00th=[  106], 95.00th=[  138],
     | 99.00th=[  201], 99.50th=[  218], 99.90th=[  271], 99.95th=[  401],
     | 99.99th=[  464]
   bw (  KiB/s): min=110592, max=1172480, per=100.00%, avg=345257.88, stdev=70427.87, samples=241
   iops        : min= 1356, max=14008, avg=4148.71, stdev=844.51, samples=241
  lat (msec)   : 4=0.01%, 10=1.00%, 20=7.24%, 50=36.55%, 100=43.75%
  lat (msec)   : 250=11.26%, 500=0.18%
  cpu          : usr=3.14%, sys=22.43%, ctx=97958, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,251984,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=336MiB/s (352MB/s), 336MiB/s-336MiB/s (352MB/s-352MB/s), io=20.0GiB (21.5GB), run=60922-60922msec